=====================================
String assignment
=====================================

message = "Hello World"

---

(source_file
  (statement
    (assignment
      (assignment_target
        (identifier))
      (expression
        (literal
          (string
                  (double_quoted_string)))))))

=====================================
Function call assignment
=====================================

content = readFile("test.txt")

---

(source_file
  (statement
    (assignment
      (assignment_target
        (identifier))
      (expression
        (call_expression
          (expression
            (identifier))
          (argument_list
            (expression
              (literal
                (string
                  (double_quoted_string))))))))))

=====================================
Member expression assignment
=====================================

result = server.method("arg", variable)

---

(source_file
  (statement
    (assignment
      (assignment_target
        (identifier))
      (expression
        (call_expression
          (expression
            (member_expression
              (expression
                (identifier))
              (identifier)))
          (argument_list
            (expression
              (literal
                (string
                  (double_quoted_string))))
            (expression
              (identifier))))))))

=====================================
Number assignment
=====================================

count = 42

---

(source_file
  (statement
    (assignment
      (assignment_target
        (identifier))
      (expression
        (literal
          (number))))))

=====================================
Member property assignment
=====================================

obj.property = "value"

---

(source_file
  (statement
    (assignment
      (assignment_target
        (member_expression
          (expression
            (identifier))
          (identifier)))
      (expression
        (literal
          (string
            (double_quoted_string)))))))

=====================================
Array index assignment
=====================================

array[0] = 42

---

(source_file
  (statement
    (assignment
      (assignment_target
        (bracket_expression
          (expression
            (identifier))
          (expression
            (literal
              (number)))))
      (expression
        (literal
          (number))))))

=====================================
Complex member assignment
=====================================

obj.nested.prop = getValue()

---

(source_file
  (statement
    (assignment
      (assignment_target
        (member_expression
          (expression
            (member_expression
              (expression
                (identifier))
              (identifier)))
          (identifier)))
      (expression
        (call_expression
          (expression
            (identifier)))))))

=====================================
Complex bracket assignment
=====================================

matrix[row][col] = data.value

---

(source_file
  (statement
    (assignment
      (assignment_target
        (bracket_expression
          (expression
            (bracket_expression
              (expression
                (identifier))
              (expression
                (identifier))))
          (expression
            (identifier))))
      (expression
        (member_expression
          (expression
            (identifier))
          (identifier))))))